// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

Console.WriteLine("Введите два числа:"); 

double Num1 = Convert.ToDouble(Console.ReadLine());

double Num2 = Convert.ToDouble(Console.ReadLine());

if (Num1 > Num2)
{
Console.Write("Максимальное число: " + Num2); 
}

else
{
Console.Write("Максимальное число: " + Num2); 
}